---
kind: property
id: P:Autodesk.Revit.DB.GeomCombinationSet.Size
source: html/a641f9be-2381-c55a-8a9a-ff824029ad4e.htm
---
# Autodesk.Revit.DB.GeomCombinationSet.Size Property

Returns the number of GeomCombinations that are in the set.

## Syntax (C#)
```csharp
public virtual int Size { get; }
```